STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/BFU_1_Image/1_Image_BFU/BFU/Target/sfu_low_level_security.c
/**
  ******************************************************************************
  * @file    sfu_low_level_security.c
  * @author  MCD Application Team
  * @brief   SFU Security Low Level Interface module
  *          This file provides set of firmware functions to manage SFU security
  *          low level interface.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "sfu_low_level_security.h"
#include "sfu_low_level_flash_int.h"
#include "sfu_low_level.h"
#include "sfu_trace.h"
#include "sfu_boot.h"
#include "sfu_fsm_states.h" /* needed for sfu_error.h */
#include "sfu_error.h"
#include "stm32wlxx_it.h"

#ifndef  SFU_WRP_PROTECT_ENABLE
#if   !defined(SECBOOT_DISABLE_SECURITY_IPS)
#warning "SFU_WRP_PROTECT_DISABLED"
#endif /* !SECBOOT_DISABLE_SECURITY_IPS */
#endif /* SFU_WRP_PROTECT_ENABLE */

#ifndef  SFU_RDP_PROTECT_ENABLE
#if   !defined(SECBOOT_DISABLE_SECURITY_IPS)
#warning "SFU_RDP_PROTECT_DISABLED"
#endif /* !SECBOOT_DISABLE_SECURITY_IPS */
#endif /* SFU_RDP_PROTECT_ENABLE */


#ifndef  SFU_MPU_PROTECT_ENABLE
#if   !defined(SECBOOT_DISABLE_SECURITY_IPS)
#warning "SFU_MPU_PROTECT_DISABLED"
#endif /* !SECBOOT_DISABLE_SECURITY_IPS */
#endif /* SFU_MPU_PROTECT_ENABLE */


#ifndef  SFU_TAMPER_PROTECT_ENABLE
#if   !defined(SECBOOT_DISABLE_SECURITY_IPS)
#warning "SFU_TAMPER_PROTECT_DISABLED"
#endif /* !SECBOOT_DISABLE_SECURITY_IPS */
#endif /* SFU_TAMPER_PROTECT_ENABLE */

#ifndef  SFU_DAP_PROTECT_ENABLE
#if   !defined(SECBOOT_DISABLE_SECURITY_IPS)
#warning "SFU_DAP_PROTECT_DISABLED"
#endif /* !SECBOOT_DISABLE_SECURITY_IPS */
#endif /* SFU_DAP_PROTECT_ENABLE */

#ifndef  SFU_DMA_PROTECT_ENABLE
#if   !defined(SECBOOT_DISABLE_SECURITY_IPS)
#warning "SFU_DMA_PROTECT_DISABLED"
#endif /* !SECBOOT_DISABLE_SECURITY_IPS */
#endif /* SFU_DMA_PROTECT_ENABLE */

#ifndef  SFU_IWDG_PROTECT_ENABLE
#if   !defined(SECBOOT_DISABLE_SECURITY_IPS)
#warning "SFU_IWDG_PROTECT_DISABLED"
#endif /* !SECBOOT_DISABLE_SECURITY_IPS */
#endif /* SFU_IWDG_PROTECT_ENABLE */


/* Private typedef -----------------------------------------------------------*/
typedef enum
{
  SFU_FALSE = 0U,
  SFU_TRUE = !SFU_FALSE
} SFU_BoolTypeDef;

typedef struct
{
  uint8_t                Number;            /*!< Specifies the number of the region to protect. This parameter can be a
                                                 value of CORTEX_MPU_Region_Number */
  uint32_t               BaseAddress;       /*!< Specifies the base address of the region to protect. */
  uint8_t                Size;              /*!< Specifies the size of the region to protect. */
  uint8_t                AccessPermission;  /*!< Specifies the region access permission type. This parameter can be a
                                                 value of CORTEX_MPU_Region_Permission_Attributes */
  uint8_t                DisableExec;       /*!< Specifies the instruction access status. This parameter can be a value
                                                 of  CORTEX_MPU_Instruction_Access */
  uint8_t                SubRegionDisable;  /*!< Specifies the sub region field (region is divided in 8 slices) when bit
                                                 is 1 region sub region is disabled */
} SFU_MPU_InitTypeDef;

typedef uint32_t      SFU_ProtectionTypeDef;  /*!<   SFU HAL IF Protection Type Def*/

/* Private variables ---------------------------------------------------------*/
#ifdef  SFU_IWDG_PROTECT_ENABLE
static IWDG_HandleTypeDef   IwdgHandle;

#endif /* SFU_IWDG_PROTECT_ENABLE */
#ifdef  SFU_MPU_PROTECT_ENABLE
static SFU_MPU_InitTypeDef MpuAreas[] =

  {
    {
      MPU_REGION_NUMBER0, SFU_PROTECT_MPU_AREA_USER_START,     SFU_PROTECT_MPU_AREA_USER_SIZE,
      SFU_PROTECT_MPU_AREA_USER_PERM,     SFU_PROTECT_MPU_AREA_USER_EXEC,     SFU_PROTECT_MPU_AREA_USER_SREG
    },
{
  MPU_REGION_NUMBER1, SFU_PROTECT_MPU_AREA_SFUEN_START_0,  SFU_PROTECT_MPU_AREA_SFUEN_SIZE_0,
  SFU_PROTECT_MPU_AREA_SFUEN_PERM,    SFU_PROTECT_MPU_AREA_SFUEN_EXEC,    SFU_PROTECT_MPU_AREA_SFUEN_SREG_0
},
{
  MPU_REGION_NUMBER2, SFU_PROTECT_MPU_AREA_SFUEN_START_1,  SFU_PROTECT_MPU_AREA_SFUEN_SIZE_1,
  SFU_PROTECT_MPU_AREA_SFUEN_PERM,    SFU_PROTECT_MPU_AREA_SFUEN_EXEC,    SFU_PROTECT_MPU_AREA_SFUEN_SREG_1
},
{
  MPU_REGION_NUMBER3, SFU_PROTECT_MPU_AREA_VECT_START,     SFU_PROTECT_MPU_AREA_VECT_SIZE,
  SFU_PROTECT_MPU_AREA_VECT_PERM,     SFU_PROTECT_MPU_AREA_VECT_EXEC,     SFU_PROTECT_MPU_AREA_VECT_SREG
},
{
  MPU_REGION_NUMBER4, SFU_PROTECT_MPU_AREA_OB_BANK1_START, SFU_PROTECT_MPU_AREA_OB_BANK1_SIZE,
  SFU_PROTECT_MPU_AREA_OB_BANK1_PERM, SFU_PROTECT_MPU_AREA_OB_BANK1_EXEC, SFU_PROTECT_MPU_AREA_OB_BANK1_SREG
},
{
  MPU_REGION_NUMBER5, SFU_PROTECT_MPU_AREA_PERIPH_START,   SFU_PROTECT_MPU_AREA_PERIPH_SIZE,
  SFU_PROTECT_MPU_AREA_PERIPH_PERM,   SFU_PROTECT_MPU_AREA_PERIPH_EXEC,   SFU_PROTECT_MPU_AREA_PERIPH_SREG
},
  };
#endif /* SFU_MPU_PROTECT_ENABLE */

/* Private function prototypes -----------------------------------------------*/
static SFU_ErrorStatus SFU_LL_SECU_CheckFlashConfiguration(FLASH_OBProgramInitTypeDef *psFlashOptionBytes);
static SFU_ErrorStatus SFU_LL_SECU_SetFlashConfiguration(FLASH_OBProgramInitTypeDef *psFlashOptionBytes,
                                                         SFU_BoolTypeDef *pbIsProtectionToBeApplied);

#ifdef SFU_RDP_PROTECT_ENABLE
static SFU_ErrorStatus SFU_LL_SECU_SetProtectionRDP(FLASH_OBProgramInitTypeDef *psFlashOptionBytes,
                                                    SFU_BoolTypeDef *pbIsProtectionToBeApplied);
#endif /*SFU_RDP_PROTECT_ENABLE*/

